In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\kriti\OneDrive - Manipal Academy of Higher Education\Desktop\salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [2]:
inputs=df.drop('salary_more_then_100k',axis='columns')
target=df['salary_more_then_100k']

In [7]:
#Ml model only works for numerical value,here we labelEncoded label columns into numbers 
from sklearn.preprocessing import LabelEncoder

In [9]:
#we created extra columns 
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [12]:
inputs['company_n']=le_company.fit_transform(inputs['company'])
inputs['job_n']=le_company.fit_transform(inputs['job'])
inputs['degree_n']=le_company.fit_transform(inputs['degree'])
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [13]:
inputs_n=inputs.drop(['company','job','degree'],axis='columns')
inputs_n  #2 is google,0 is ABC pharma, 1 is facebook

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [14]:
#train the classifier 
#we import decision tree 
from sklearn import tree

In [17]:
model= tree.DecisionTreeClassifier()

In [19]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [20]:
model.score(inputs_n,target)

1.0

In [22]:
#predict the salary of person working in google, as sales executive with masters degree
model.predict([[2,2,1]])

array([0], dtype=int64)

In [ ]:
#we get predicted value as 0, the person's salary will be less then 100k